#Какие типы данных являются простыми (скалярными)?-int,float,complex,bool и str.
#В чём разница между list и tuple?-список изменяемый,списки создаются через квадратные скобки [], кортежи — через круглые ()
#Почему важно понимать, является ли тип данных изменяемым или нет?-Чтобы избежать ошибок — попытка изменить кортеж или строку вызовет ошибку,защита данных.
#Зачем нужно преобразование типов?- В каких случаях оно обязательно?Для корректного выполнения операций. Нельзя сложить строку с числом без приведения к общему типу. Также это необходимо для взаимодействия функций
#Какие ошибки могут возникнуть при преобразовании, и как с ними бороться?-Основная ошибка — ValueError,чтобы поборосться необходимо вводить одинаковые данные,TypeError-возникает, когда операция применяется к объекту не того типа,чтобы исправить необходимо перепроверить данные,исправить явные ошибки и соблдать правила изменяемости/неизменяемости

